init.org
#+TITLE: Emacs Literate Configuration
#+AUTHOR: Georgi Bojinov
#+PROPERTY: header-args :tangle init.el

* Configure all the Emacs!
** Table of contents :TOC_4_gh:
- [[#configure-all-the-emacs][Configure all the Emacs!]]
  - [[#package-manager][Package manager]]
    - [[#bootstrap-code-for-the-package-manager---straightel][Bootstrap code for the package manager - ~straight.el~]]
    - [[#install-use-package-for-sane-package-configuration][Install use-package for sane package configuration]]
    - [[#ensure-system-packages-to-check-they-exist][Ensure system packages to check they exist]]
  - [[#general-configs][General configs]]
    - [[#tangle-config-file-on-save][Tangle config file on save]]
    - [[#custom-vars-file][Custom vars file]]
    - [[#start-emacs-in-fullscreen][Start emacs in fullscreen]]
    - [[#set-the-emacs-user-directory][Set the emacs user directory]]
    - [[#set-the-default-font][Set the default font]]
    - [[#set-the-theme][Set the theme]]
    - [[#no-scrollbar-toolbar-menubar-because-bloat][No scrollbar, toolbar, menubar, because bloat]]
    - [[#line-numbers--relative-line-numbers][Line numbers + relative line numbers]]
    - [[#display-battery-in-the-bar][Display battery in the bar]]
    - [[#display-time-in-the-bar][Display time in the bar]]
    - [[#use-spaces-instead-of-tabs][Use spaces instead of tabs]]
    - [[#commenting][Commenting]]
    - [[#command-log-mode][Command log mode]]
    - [[#storing-links][Storing links]]
    - [[#which-key][Which-key]]
    - [[#undo][Undo]]
    - [[#buffer-display][Buffer display]]
    - [[#delete-unnecessary-whitespace][Delete unnecessary whitespace]]
  - [[#keybindings][Keybindings]]
  - [[#margins][Margins]]
  - [[#modeline][Modeline]]
  - [[#dashboard][Dashboard]]
  - [[#evil-mode][Evil-mode]]
    - [[#evil-mode-configs][Evil mode configs]]
    - [[#org-mode-integration-with-evil][Org mode integration with evil]]
    - [[#evil-collection-mode][Evil collection mode]]
  - [[#org-mode][Org-mode]]
    - [[#general][General]]
    - [[#org-roam][Org-roam]]
      - [[#deft-for-viewing-roam-files][Deft for viewing roam files]]
    - [[#ox-hugo][Ox-hugo]]
    - [[#org-reading-list][Org reading list]]
    - [[#toc][Toc]]
    - [[#org-journal][Org journal]]
    - [[#org-babel][Org babel]]
    - [[#notifications][Notifications]]
    - [[#pomodoro][Pomodoro]]
    - [[#kanban][Kanban]]
    - [[#org-super-agenda][Org super agenda]]
  - [[#magit][Magit]]
  - [[#helm][Helm]]
  - [[#counsel][Counsel]]
  - [[#ivy][Ivy]]
  - [[#company][Company]]
  - [[#snippets][Snippets]]
  - [[#how-do-you][How-do-you]]
  - [[#language-specific][Language-specific]]
    - [[#web-mode][Web-mode]]
    - [[#general-1][General]]
    - [[#rust][Rust]]
    - [[#glsl][GLSL]]
    - [[#lua][Lua]]
    - [[#ruby][Ruby]]
    - [[#typescript][Typescript]]
    - [[#scala][Scala]]
    - [[#gdscript][GDScript]]
    - [[#python][Python]]
    - [[#clojure][Clojure]]
  - [[#projectile][Projectile]]
  - [[#parens][Parens]]
  - [[#flycheck][Flycheck]]
  - [[#emojify][Emojify]]
  - [[#helpful][Helpful]]
  - [[#elisp-repl][Elisp repl]]
  - [[#better-link-opener][Better link opener]]
  - [[#email][Email]]
  - [[#persistent-scratch][Persistent scratch]]
  - [[#esup][Esup]]
  - [[#emms][EMMS]]

** Package manager
Must be in the beginning for ~use-package~ usage below.
*** Bootstrap code for the package manager - ~straight.el~
#+begin_src elisp
(defvar bootstrap-version)
(let ((bootstrap-file
        (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
    (bootstrap-version 5))
(unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
        "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
        'silent 'inhibit-cookies)
    (goto-char (point-max))
    (eval-print-last-sexp)))
(load bootstrap-file nil 'nomessage))
#+end_src

*** Install use-package for sane package configuration
#+begin_src elisp
(straight-use-package 'use-package)
#+end_src
*** Ensure system packages to check they exist
#+begin_src elisp
(use-package use-package-ensure-system-package
  :straight t)
#+end_src
** General configs
*** Tangle config file on save
Courtesy of the great emacs from scratch config: [[https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org#auto-tangle-configuration-files][Link]]
#+begin_src elisp
(defun nimor/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.emacs.d/init.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook
  (lambda () (add-hook 'after-save-hook #'nimor/org-babel-tangle-config)))
#+end_src
*** Custom vars file
#+begin_src elisp
(setq-default
  custom-file "~/.emacs.d/custom.el")

(when (file-exists-p custom-file)
  (load custom-file t))
#+end_src
*** Start emacs in fullscreen
#+begin_src elisp
(add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src
*** Set the emacs user directory
#+begin_src elisp
(let* ((home-dir (getenv "HOME"))
     (custom-emacs-directory (concat home-dir "/.emacs.d")))
  (setq user-emacs-directory custom-emacs-directory))
#+end_src
*** Set the default font
This is seriously retarded.
#+begin_src elisp
(if (eq system-type 'gnu/linux)
  (set-frame-font "Jet Brains Mono 18")
  (set-frame-font "JetBrains Mono 18"))
#+end_src
*** Set the theme
Ok I like the doom emacs themes
#+begin_src elisp
(use-package doom-themes
  :straight t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-dracula t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src
*** No scrollbar, toolbar, menubar, because bloat
#+begin_src elisp
(scroll-bar-mode -1)
(tool-bar-mode -1)
(menu-bar-mode -1)
#+end_src
*** Line numbers + relative line numbers
#+begin_src elisp
(global-display-line-numbers-mode)
(setq display-line-numbers-type 'relative)
#+end_src
*** Display battery in the bar
#+begin_src elisp
(display-battery-mode t)
#+end_src
*** Display time in the bar
#+begin_src elisp
(setq display-time-format "%H:%M %a,%d %b %Y")
(display-time)
#+end_src
*** Use spaces instead of tabs
#+begin_src elisp
(setq-default indent-tabs-mode nil)
#+end_src
*** Commenting
#+begin_src elisp
(use-package evil-nerd-commenter
  :straight t
  :config
  (evilnc-default-hotkeys))
#+end_src
*** Command log mode
Show command history in sidebar. Looks slick.
#+begin_src elisp
(use-package command-log-mode
  :straight t)
#+end_src
*** Storing links
Set key bindings for ~org-store-link~
#+begin_src elisp
(global-set-key (kbd "C-c l") 'org-store-link)
#+end_src
*** Which-key
Showing a popup for key combinations that follow the pressed key (like in Spacemacs and Doom)
#+begin_src elisp
(use-package which-key
  :straight t
  :config
  (which-key-mode))
#+end_src
*** Undo
#+begin_src elisp
(use-package undo-tree
  :straight t
  :init
  (global-undo-tree-mode))
#+end_src
*** Buffer display
When running ~display-buffer~, will show the ~*Emacs Log*~ buffer on the right side of the window
#+begin_src elisp
(setq display-buffer-alist
  `(;; Messages, errors, processes, Calendar in the bottom side window
     (,(rx bos (or "*Emacs Log*"))  ; interaction log *Emacs Log*
       (display-buffer-reuse-window display-buffer-in-side-window)
       (side . right)
       (reusable-frames . visible)
       (window-height . 0.45))
       ;; Let `display-buffer' reuse visible frames for all buffers. This must
       ;; be the last entry in `display-buffer-alist', because it overrides any
       ;; previous entry with more actions.
     ("." nil (reusable-frames . visible))))
#+end_src
*** Delete unnecessary whitespace
#+begin_src elisp
(use-package simple
  :hook (before-save . delete-trailing-whitespace))
#+end_src
