init.org
*** General
Installing and configuring org-mode:
1. Use ~org-tempo~ for easier inserting of structure templates
   (e.g. using <s TAB for inserting code blocks)
2. Add some bindings to ~org-agenda~ for day, week view, clocking in and out, add org agenda files.
3. Set refile targets to my various GTD files
4. Set capture templates
5. Set todo keywords
6. Indent, fold org files by default

#+begin_src elisp
(defun nimor/org-mode-setup ()
  (org-indent-mode)
  (visual-line-mode 1))

(use-package org
  :straight t
  :hook
  (org-mode . nimor/org-mode-setup)
  :config
  ;; make org-agenda respect evil
  (evil-set-initial-state 'org-agenda-mode 'normal)

  ;; org-agenda custom bindings
  (evil-define-key 'normal org-agenda-mode-map
    "vd" 'org-agenda-day-view
    "vw" 'org-agenda-week-view
    "I"  'org-agenda-clock-in
    "O"  'org-agenda-clock-out)

  ;; files that org-agenda will read from
  (setq org-agenda-files
  '("~/Nextcloud/Orgzly/gtd.org"
    "~/Nextcloud/Orgzly/tickler.org"
    "~/Nextcloud/Orgzly/inbox.org"
    "~/Nextcloud/Orgzly/daily.org"
    "~/Nextcloud/org/work/work.org"
    "~/Nextcloud/org/reading_list.org"))

  (setq org-agenda-start-with-log-mode t)
  ;; org-agenda custom views
  (setq org-agenda-custom-commands
    '(("g" "GTD" tags-todo "@gtd"
      ((org-agenda-overriding-header "GTD")))))

  ;; files to refile to
  (setq org-refile-targets
    '(("~/Nextcloud/Orgzly/gtd.org"     :maxlevel . 9)
      ("~/Nextcloud/Orgzly/someday.org" :maxlevel . 9)
      ("~/Nextcloud/Orgzly/tickler.org" :maxlevel . 9)))

  ;; quick templates for org files
  (setq org-capture-templates
    '(("t" "Todo [inbox]" entry
      (file+headline "~/Nextcloud/Orgzly/inbox.org" "Tasks")
      "* TODO %i%?")
      ("T" "Tickler" entry
      (file+headline "~/Nextcloud/Orgzly/tickler.org" "Tickler")
      "* TODO %i%? \n SCHEDULED: %T")
      ("M" "Mail Todo with link" entry
      (file+headline "~/Nextcloud/Orgzly/inbox.org" "Tasks")
      "* TODO %i%? \n:PROPERTIES: \n:CREATED: %U \n:END: \n %a\n")
      ("W" "Finnish word of the day" entry
      (file+headline "~/Nextcloud/Orgzly/inbox.org" "Tasks")
      "* TODO Word of the day - %t \n:PROPERTIES: \n:CREATED: %U \n:END: \n %a\n")
      ("d" "Todo [daily]" entry
        (file+olp+datetree "~/Nextcloud/Orgzly/daily.org")
        "* TODO %i%? \n SCHEDULED: %t")
      ("D" "Todo with link [daily]" entry
        (file+olp+datetree "~/Nextcloud/Orgzly/daily.org")
        "* TODO %a \n SCHEDULED: %t")))

  ;; TODO keywords that I use - the ones after the | are the done states
  (setq org-todo-keywords '((sequence "TODO(t)" "WAITING(w)" "IN PROGRESS(p)" "|" "DONE(d)" "CANCELLED(c)")))

  ;; Clocking settings
  (setq org-pretty-entities t)

  ;; indentation settings and other misc stuff
  (setq org-startup-indented t)
  (setq org-startup-folded t)
  (setq org-log-done 'note)
  (setq org-tags-column 0)
  (setq org-agenda-tags-column 0)

  ;; org habit
  (setq org-habit-show-all-today t
        org-habit-show-habits-only-for-today t
        ;;org-habit-show-done-always-green t
        org-habit-graph-column 80
        org-habit-preceding-days 28
        org-habit-following-days 7)

  (setq org-src-fontify-natively t
        org-src-preserve-indentation t ;; do not put two spaces on the left
        org-src-tab-acts-natively t)

  (setq yt-iframe-format
    ;; You may want to change your width and height.
    (concat "<iframe width=\"440\""
            " height=\"335\""
            " src=\"https://www.youtube.com/embed/%s\""
            " frameborder=\"0\""
            " allowfullscreen>%s</iframe>"))

  (org-add-link-type
   "yt"
   (lambda (handle)
     (browse-url
      (concat "https://www.youtube.com/embed/"
              handle)))
   (lambda (path desc backend)
     (cl-case backend
       (html (format yt-iframe-format
                   path (or desc "")))
       (latex (format "\href{%s}{%s}"
                    path (or desc "video")))))))
#+end_src

Like org bullets, but supercharged?

#+begin_src elisp
(use-package org-superstar
  :straight t
  :after org
  :hook (org-mode . org-superstar-mode))
#+end_src

For inserting code snippets (with ~<s~ for example)

#+begin_src elisp
(use-package org-tempo
  :after org)
#+end_src

Disable line numbers in org-mode
#+begin_src elisp
(add-hook 'org-mode-hook (lambda () (display-line-numbers-mode 0)))
#+end_src
*** Org-roam
The notes (zettelkasten) god

#+begin_src elisp
(use-package org-roam
  :straight
  (:host github :repo "jethrokuan/org-roam" :branch "master")
  :hook
  (after-init . org-roam-mode)
  :custom
  (org-roam-directory "~/Nextcloud/org-roam")
  :config
  (setq org-roam-directory "~/Nextcloud/org-roam")
  (nimor/leader-keys
    "n" '(:ignore t :which-key "org-roam")
    "nl" 'org-roam
    "nf" 'org-roam-find-file
    "ng" 'org-roam-graph-show
    "ni" 'org-roam-insert
    "nI" 'org-roam-insert-immediate
    "no" 'org-roam-dailies-capture-today)

  (setq org-roam-completion-everywhere t)

  (setq org-roam-dailies-directory "daily/")

  (setq org-roam-dailies-capture-templates
    '(("d" "daily" entry
       #'org-roam-capture--get-point
       "* %<%H:%M> %?"
       :file-name "daily/%<%Y-%m-%d>"
       :head "#+title: %<%Y-%m-%d>\n"
       :olp ("Daily notes"))

      ("j" "journal" entry
       #'org-roam-capture--get-point
       "* %<%H:%M> %?"
       :file-name "daily/%<%Y-%m-%d>"
       :head "#+title: %<%Y-%m-%d>\n"
       :olp ("Journal")))))
#+end_src

**** Deft for viewing roam files

#+begin_src elisp
(use-package deft
  :straight t
  :after org
  :bind
  ("C-c n d" . deft)
  :custom
  (deft-recursive t)
  (deft-use-filter-string-for-filename t)
  (deft-default-extension "org")
  (deft-directory "~/Nextcloud/org-roam"))
#+end_src
*** Ox-hugo
Export org mode files to Hugo markdown.

#+begin_src elisp
(use-package ox-hugo
  :straight t
  :after ox)
#+end_src
*** Org reading list
Manage yer books.
#+begin_src elisp
(use-package org-books
  :straight t
  :after org
  :config
  (setq org-books-file "~/Nextcloud/org/reading_list.org"))
#+end_src
*** Toc
Table of contents on save for org files, it's awesome

#+begin_src elisp
(use-package toc-org
  :straight t
  :after org
  :hook
  (org-mode . toc-org-enable))
#+end_src
*** Org journal
For your journaling needs.
#+begin_src elisp
;; TODO Remove this as it's in org roam now
(use-package org-journal
  :straight t
  :after org
  :config
  (setq org-journal-dir "~/Documents/journal")
  (setq org-journal-date-format "%A, %d %B %Y")
  (nimor/leader-keys
    "nj" 'org-journal-new-entry))
#+end_src
*** Org babel
#+begin_src elisp
(use-package ob
  :defer t
  :after org
  :config
  (org-babel-do-load-languages
    'org-babel-load-languages
      '((python . t)
        (shell  . t)
      )))
#+end_src
*** Notifications
#+begin_src elisp
(use-package alert
  :straight t
  :defer t
  :config
  (setq alert-default-style
    (if (eq system-type 'gnu/linux)
        'notifications
        'notifier)))

(use-package org-wild-notifier
  :straight t
  :after org
  :config
  (org-wild-notifier-mode 1)
  (setq org-wild-notifier-alert-time '(10 0)))
#+end_src
*** Pomodoro
#+begin_src elisp
(use-package org-pomodoro
  :straight t
  :after org
  :config
  (setq org-pomodoro-finished-sound (concat user-emacs-directory "/eraser.mp3"))
  (setq org-pomodoro-short-break-sound (concat user-emacs-directory "/eraser.mp3"))
  (setq org-pomodoro-long-break-sound (concat user-emacs-directory "/eraser.mp3")))
#+end_src
*** Kanban
#+begin_src elisp
(use-package org-kanban
  :straight t
  :after org)
#+end_src
*** Org super agenda
For a better way to group entries in the agenda.
#+begin_src elisp
(use-package org-super-agenda
  :straight t
  :after org
  :config
  (org-super-agenda-mode 1)
  ;; conflicts of header bindings with evil-mode
  (setq org-super-agenda-header-map nil)
  (setq org-super-agenda-groups
       '((:auto-category t)
         (:discard (:not  ; Is it easier to read like this?
                    (:and
                     (:todo "READING" :file-path "reading_list")))))))
#+end_src
** Magit
The git supercharge

#+begin_src elisp
(use-package magit
  :straight t
  :defer t)
#+end_src

Something weird with ~emacsclient~ being installed with nix and magit not finding it when not started from a terminal (not sure if this is needed tbh)

#+begin_src elisp
(setq-default with-editor-emacsclient-executable "emacsclient")
#+end_src
